app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "zizo"], ["body", "zizo zizoaskjdaksjdh"], ["created_at", "2022-02-01 12:19:13.560087"], ["updated_at", "2022-02-01 12:19:13.560087"]]

  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "test1"], ["body", "bodyyyyyyyyyyy"], ["updated_at", "2022-02-01 12:17:11.309911"], ["id", 1]]